docs/MOOC/ai_for_trading/zipline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-15 Fri 18:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Zipline Example</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Zipline Example</h1>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> os
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.data <span style="color: #3a81c3; font-weight: bold;">import</span> bundles
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.data.bundles.csvdir <span style="color: #3a81c3; font-weight: bold;">import</span> csvdir_equities
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.pipeline <span style="color: #3a81c3; font-weight: bold;">import</span> Pipeline
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.pipeline.factors <span style="color: #3a81c3; font-weight: bold;">import</span> AverageDollarVolume

<span style="color: #715ab1;">bundle_name</span> = <span style="color: #2d9574;">"eod-quotemedia"</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Create an ingest function</span>
<span style="color: #715ab1;">ingest_func</span> = csvdir_equities<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">[</span><span style="color: #2d9574;">"daily"</span><span style="color: #6c3163;">]</span>, bundle_name<span style="color: #3a81c3;">)</span>
bundles.register<span style="color: #3a81c3;">(</span>bundle_name, ingest_func<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Set env to the data path</span>
<span style="color: #715ab1;">os.environ</span><span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"ZIPLINE_ROOT"</span><span style="color: #3a81c3;">]</span> = ...

<span style="color: #715ab1;">bundle_data</span> = bundles.load<span style="color: #3a81c3;">(</span>bundle_name<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Create a screen and an pipeline</span>
<span style="color: #715ab1;">universe</span> = AverageDollarVolume<span style="color: #3a81c3;">(</span>window_length = 60<span style="color: #3a81c3;">)</span>.top<span style="color: #3a81c3;">(</span>10<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">pipeline</span> = Pipeline<span style="color: #3a81c3;">(</span>screen = universe<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Render the pipeline as a DAG</span>
pipeline.show_graph<span style="color: #3a81c3;">()</span>

<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.pipeline.loaders <span style="color: #3a81c3; font-weight: bold;">import</span> USEquityPricingLoader
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Set the dataloader</span>
<span style="color: #715ab1;">pricing_loader</span> = USEquityPricingLoader<span style="color: #3a81c3;">(</span>bundle_data.equity_daily_bar_reader, bundle_data.adjustment_reader<span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Create a Pipeline engine</span>
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.utils.calendars <span style="color: #3a81c3; font-weight: bold;">import</span> get_calendar
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.pipeline.data <span style="color: #3a81c3; font-weight: bold;">import</span> USEquityPricing
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.pipeline.engine <span style="color: #3a81c3; font-weight: bold;">import</span> SimplePipelineEngine

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Define the function for the get_loader parameter</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">choose_loader</span><span style="color: #3a81c3;">(</span>column<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">if</span> column <span style="color: #3a81c3; font-weight: bold;">not</span> <span style="color: #3a81c3; font-weight: bold;">in</span> USEquityPricing.columns:
	<span style="color: #3a81c3; font-weight: bold;">raise</span> <span style="color: #ba2f59; font-weight: bold;">Exception</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Column not in USEquityPricing'</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> pricing_loader

<span style="color: #715ab1;">trading_calendar</span> = get_calendar<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'NYSE'</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">engine</span> = SimplePipelineEngine<span style="color: #3a81c3;">(</span>get_loader = choose_loader,
			      calendar = trading_calendar.all_sessions,
			      asset_finder = bundle_data.asset_finder<span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Running a Pipeline</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> pandas <span style="color: #3a81c3; font-weight: bold;">as</span> pd
<span style="color: #715ab1;">start_date</span> = pd.Timestamp<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'2016-01-05'</span>, tz = <span style="color: #2d9574;">'utc'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">end_date</span> = pd.Timestamp<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'2016-01-05'</span>, tz = <span style="color: #2d9574;">'utc'</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">pipeline_output</span> = engine.run_pipeline<span style="color: #3a81c3;">(</span>pipeline, start_date, end_date<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'The pipeline output has type:'</span>, <span style="color: #3a81c3;">type</span><span style="color: #6c3163;">(</span>pipeline_output<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Is the pipeline output a MultiIndex Dataframe:'</span>, <span style="color: #3a81c3;">isinstance</span><span style="color: #6c3163;">(</span>pipeline_output.index, pd.core.index.MultiIndex<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Get tickers</span>
<span style="color: #715ab1;">universe_tickers</span> = pipeline_output.index.get_level_values<span style="color: #3a81c3;">(</span>1<span style="color: #3a81c3;">)</span>.values.tolist<span style="color: #3a81c3;">()</span>

<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.data.data_portal <span style="color: #3a81c3; font-weight: bold;">import</span> DataPortal

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Create a data portal</span>
<span style="color: #715ab1;">data_portal</span> = DataPortal<span style="color: #3a81c3;">(</span>bundle_data.asset_finder,
			 trading_calendar = trading_calendar,
			 first_trading_day = bundle_data.equity_daily_bar_reader.first_trading_day,
			 equity_daily_reader = bundle_data.equity_daily_bar_reader,
			 adjustment_reader = bundle_data.adjustment_reader<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">get_pricing</span><span style="color: #3a81c3;">(</span>data_portal, trading_calendar, assets, start_date, end_date, field=<span style="color: #2d9574;">'close'</span><span style="color: #3a81c3;">)</span>:

    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Set the given start and end dates to Timestamps. The frequency string C is used to</span>
    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">indicate that a CustomBusinessDay DateOffset is used</span>
    <span style="color: #715ab1;">end_dt</span> = pd.Timestamp<span style="color: #3a81c3;">(</span>end_date, tz=<span style="color: #2d9574;">'UTC'</span>, freq=<span style="color: #2d9574;">'C'</span><span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">start_dt</span> = pd.Timestamp<span style="color: #3a81c3;">(</span>start_date, tz=<span style="color: #2d9574;">'UTC'</span>, freq=<span style="color: #2d9574;">'C'</span><span style="color: #3a81c3;">)</span>

    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Get the locations of the start and end dates</span>
    <span style="color: #715ab1;">end_loc</span> = trading_calendar.closes.index.get_loc<span style="color: #3a81c3;">(</span>end_dt<span style="color: #3a81c3;">)</span>
    <span style="color: #715ab1;">start_loc</span> = trading_calendar.closes.index.get_loc<span style="color: #3a81c3;">(</span>start_dt<span style="color: #3a81c3;">)</span>

    <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">return the historical data for the given window</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> data_portal.get_history_window<span style="color: #3a81c3;">(</span>assets=assets, end_dt=end_dt, bar_count=end_loc - start_loc,
					  frequency=<span style="color: #2d9574;">'1d'</span>,
					  field=field,
					  data_frequency=<span style="color: #2d9574;">'daily'</span><span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Get the historical data for the given window</span>
<span style="color: #715ab1;">historical_data</span> = get_pricing<span style="color: #3a81c3;">(</span>data_portal, trading_calendar, universe_tickers,
			      start_date=<span style="color: #2d9574;">'2011-01-05'</span>, end_date=<span style="color: #2d9574;">'2016-01-05'</span><span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Create a factor that computes the 15-day mean closing price of securities</span>
<span style="color: #3a81c3; font-weight: bold;">from</span> zipline.pipeline.factors <span style="color: #3a81c3; font-weight: bold;">import</span> SimpleMovingAverage

<span style="color: #715ab1;">mean_close_15</span> = SimpleMovingAverage<span style="color: #3a81c3;">(</span>inputs = <span style="color: #6c3163;">[</span>USEquityPricing.close<span style="color: #6c3163;">]</span>, window_length = 15<span style="color: #3a81c3;">)</span>
pipeline.add<span style="color: #3a81c3;">(</span>mean_close_15, <span style="color: #2d9574;">'15 Day MCP'</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">pipeline.show_graph()</span>
<span style="color: #715ab1;">start_date</span> = pd.Timestamp<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'2014-01-06'</span>, tz=<span style="color: #2d9574;">'utc'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">end_date</span> = pd.Timestamp<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'2016-01-05'</span>, tz=<span style="color: #2d9574;">'utc'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">output</span> = engine.run_pipeline<span style="color: #3a81c3;">(</span>pipeline, start_date, end_date<span style="color: #3a81c3;">)</span>
output.head<span style="color: #3a81c3;">()</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Create a Filter that returns True whenever the 15-day average closing price is above $100</span>
<span style="color: #715ab1;">high_mean</span> = mean_close_15 &gt; 100
pipeline.add<span style="color: #3a81c3;">(</span>high_mean, <span style="color: #2d9574;">'High Mean'</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">pipeline.show_graph()</span>
<span style="color: #715ab1;">output</span> = engine.run_pipeline<span style="color: #3a81c3;">(</span>pipeline, start_date, end_date<span style="color: #3a81c3;">)</span>
output.head<span style="color: #3a81c3;">()</span>
</pre>
</div>
</div>
</body>
</html>
